billing_cf/InformationRegisters/энргЗначенияТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияТарифов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСверхНорматива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДСВнутри</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРЭК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаПотребителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

billing_cf/CommonModules/энргРаботаСПоставщикамиСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняется при создании формы на сервере.
//
// Параметры:
//  Форма								-	ФормаКлиентскогоПриложения.
//  ПолеОтбор							-	Строка.
//  ИмяТЧ								-	Строка.
//  ИмяРеквизитаФормы					-	Строка.
//  ИмяТаблицыДляПоляКомпоновкиДанных	-	Строка.
//
Процедура ПриСозданииФормыНаСервере(Форма,ПолеОтбор =Неопределено,ИмяТЧ="ПоставщикиСоставныхУслуг",ИмяРеквизитаФормы="ПараметрыПоставщиков", ИмяТаблицыДляПоляКомпоновкиДанных = "Объект.ТочкиУчета") Экспорт 	
	ДанныеСоставныхУслуг						= Новый Соответствие;
	СоотвествиеУсловногоОформления 				= новый Соответствие;
	ПоставщикПоУмолчанию 						= энргОбщегоНазначения.ЗначениеКонстанты("энргПоставщикПоУмолчанию");
	ИмяПоля  									= "Поставщик";
	
	Если НЕ ПолеОтбор = Неопределено тогда
		 ИмяПоля 								= ПолеОтбор;
	КонецЕсли;
	
	для Каждого стр из Форма.Объект[ИмяТЧ] цикл
		IDСтрока  								= стр.IDСтроки;
		ЕстьДанныеРаспределения 				= ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр,"РаспределятьНаАбонентов");
		ЕстьДанныеПлательщика	 				= ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(стр,"Плательщик");
		Представление							= ?(ЗначениеЗаполнено(стр[ИмяПоля]),стр[ИмяПоля],"<не указан>");
		Если ДанныеСоставныхУслуг.Получить(IDСтрока) = Неопределено тогда
			ДанныеСоставныхУслуг.Вставить(IDСтрока,Новый Структура(ИмяПоля,Представление));
		ИначеЕсли ДанныеСоставныхУслуг[IDСтрока][ИмяПоля] = Неопределено тогда
			 ДанныеСоставныхУслуг[IDСтрока].вставить(ИмяПоля,Представление);
		иначе
			ДанныеСоставныхУслуг[IDСтрока][ИмяПоля] 	= ""  + ДанныеСоставныхУслуг[IDСтрока][ИмяПоля] + "/" + Представление; 
		КонецЕсли;
		
		Если ЕстьДанныеРаспределения Тогда 
			Если ДанныеСоставныхУслуг.Получить(IDСтрока) = Неопределено тогда
				ДанныеСоставныхУслуг.Вставить(IDСтрока,Новый Структура("РаспределятьНаАбонентов",стр["РаспределятьНаАбонентов"]));
			ИначеЕсли НЕ ДанныеСоставныхУслуг[IDСтрока].Свойство("РаспределятьНаАбонентов") тогда
				ДанныеСоставныхУслуг[IDСтрока].вставить("РаспределятьНаАбонентов",стр["РаспределятьНаАбонентов"]);
			иначе
				ДанныеСоставныхУслуг[IDСтрока]["РаспределятьНаАбонентов"] 	= ""  + ДанныеСоставныхУслуг[IDСтрока]["РаспределятьНаАбонентов"] + "/" + стр["РаспределятьНаАбонентов"]; 
			КонецЕсли;
		КонецЕсли;	
		
		Если ЕстьДанныеПлательщика Тогда
			Представление						= ?(ЗначениеЗаполнено(стр["Плательщик"]),стр["Плательщик"],"<не указан>");
			Если ДанныеСоставныхУслуг.Получить(IDСтрока) = Неопределено тогда
				ДанныеСоставныхУслуг.Вставить(IDСтрока,Новый Структура("Плательщик",Представление));
			ИначеЕсли НЕ ДанныеСоставныхУслуг[IDСтрока].Свойство("Плательщик") тогда
				ДанныеСоставныхУслуг[IDСтрока].вставить("Плательщик",Представление);
			иначе
				ДанныеСоставныхУслуг[IDСтрока]["Плательщик"] 	= ""  + ДанныеСоставныхУслуг[IDСтрока]["Плательщик"] + "/" + Представление; 
			КонецЕсли;
		КонецЕсли;	
	КонецЦикла; 	
	
	Форма[ИмяРеквизитаФормы] 				= Новый Структура("ДанныеСоставныхУслуг,СоотвествиеУсловногоОформления,ПоставщикПоУмолчанию",ДанныеСоставныхУслуг,СоотвествиеУсловногоОформления,ПоставщикПоУмолчанию);
	УстановитьУсловноеОФормлениеФормы(Форма,ПолеОтбор,ИмяРеквизитаФормы,ИмяТаблицыДляПоляКомпоновкиДанных);
КонецПроцедуры

// Устанавливает условное оформление формы.
//
// Параметры:
//  Форма								-	ФормаКлиентскогоПриложения.
//  ПолеОтбор							-	Строка.
//  ИмяРеквизитаФормы					-	Строка.
//  ИмяТаблицыДляПоляКомпоновкиДанных	-	Строка.
//
Процедура УстановитьУсловноеОФормлениеФормы(Форма,ПолеОтбор=Неопределено,ИмяРеквизитаФормы="ПараметрыПоставщиков", ИмяТаблицыДляПоляКомпоновкиДанных = "Объект.ТочкиУчета") Экспорт 
	// установить условное оформление формы (для составных услуг)
	ИмяПоля  				= "Поставщик";	
	Если НЕ ПолеОтбор = Неопределено тогда
		 ИмяПоля 			= ПолеОтбор;
	КонецЕсли;
	ДанныеСоставныхУслуг 	=  Форма[ИмяРеквизитаФормы].ДанныеСоставныхУслуг;
	для Каждого КлючЗначение из ДанныеСоставныхУслуг цикл
		УстановитьЗначениеОФормления(Форма,КлючЗначение.Ключ,КлючЗначение.Значение,ПолеОтбор,ИмяРеквизитаФормы, ИмяТаблицыДляПоляКомпоновкиДанных);
	КонецЦикла; 	
КонецПроцедуры

// Устанавливает значения оформления.
//
// Параметры:
//  Форма								-	ФормаКлиентскогоПриложения.
//  IDСтроки							-	УникальныйИдентификатор.
//  ПредставлениеПолей					-	Строка.
//  ПолеОтбор							-	Строка.
//  ИмяРеквизитаФормы					-	Строка.
//  ИмяТаблицыДляПоляКомпоновкиДанных	-	Строка.
//
Процедура УстановитьЗначениеОФормления(Форма,IDСтроки,ПредставлениеПолей,ПолеОтбор,ИмяРеквизитаФормы, ИмяТаблицыДляПоляКомпоновкиДанных) Экспорт   
	
	ИмяПоля 									= "Поставщик";
	Если НЕ ПолеОтбор = Неопределено тогда
		ИмяПоля 								= ПолеОтбор;
	КонецЕсли;
		 
	СоотвествиеУсловногоОформления 				= Форма[ИмяРеквизитаФормы].СоотвествиеУсловногоОформления;
	ИскомыйID  									= IDСтроки;
	ЭлементыОтформления  						= Форма.УсловноеОформление.Элементы;
	
	Для Каждого КлючЗначение Из ПредставлениеПолей Цикл
		
		Если СоотвествиеУсловногоОформления.получить(ИскомыйID) = Неопределено тогда
			НовыйЭлемент  							= ЭлементыОтформления.Добавить();
			СтруктураПолей 							= новый Структура(КлючЗначение.Ключ, Форма.УсловноеОформление.ПолучитьИдентификаторПоОбъекту(НовыйЭлемент));
			СоотвествиеУсловногоОформления.вставить(ИскомыйID, СтруктураПолей);
		ИначеЕсли НЕ СоотвествиеУсловногоОформления[ИскомыйID].Свойство(КлючЗначение.Ключ) Тогда
			НовыйЭлемент  							= ЭлементыОтформления.Добавить();
			СоотвествиеУсловногоОформления[ИскомыйID].Вставить(КлючЗначение.Ключ, Форма.УсловноеОформление.ПолучитьИдентификаторПоОбъекту(НовыйЭлемент));
		иначе
			НовыйЭлемент  							= Форма.УсловноеОформление.ПолучитьОбъектПоИдентификатору(СоотвествиеУсловногоОформления[ИскомыйID][КлючЗначение.Ключ]);
		КонецЕсли;
		
		Отбор  										= НовыйЭлемент.Отбор;
		Отбор.элементы.очистить();
		
		ПоляЭлемента 								= НовыйЭлемент.Поля;
		Оформление  								= НовыйЭлемент.Оформление;
		
		ЭлементОтформленияТекст  					= Оформление.Элементы.Найти("Текст");
		ЭлементОтформленияТекст.Значение 			= КлючЗначение.Значение;
		ЭлементОтформленияТекст.Использование 		= Истина;
		
		ПолеЭлемента  								= ПоляЭлемента.Элементы.Добавить();
		ПолеЭлемента.Поле							= Новый ПолеКомпоновкиДанных("ТочкиУчета" + Форма.ПрефиксТочекУчета + КлючЗначение.Ключ);
		
		// Для формы узлов 
		ПолеЭлемента  								= ПоляЭлемента.Элементы.Добавить();
		ПолеЭлемента.Поле							= Новый ПолеКомпоновкиДанных(ИмяТаблицыДляПоляКомпоновкиДанных + КлючЗначение.Ключ);		
		
		ЭлементОтбора 								= Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.левоеЗначение 				= Новый ПолеКомпоновкиДанных(ИмяТаблицыДляПоляКомпоновкиДанных + ".IDСтроки");
		ЭлементОтбора.ПравоеЗначение  				= Новый УникальныйИдентификатор(IDСтроки);
		
		ЭлементОтбора 								= Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.левоеЗначение 				= Новый ПолеКомпоновкиДанных(ИмяТаблицыДляПоляКомпоновкиДанных + ".ЭтоСоставнаяУслуга");
		ЭлементОтбора.ПравоеЗначение  				= Истина;
	КонецЦикла;
КонецПроцедуры

// Записывает поставщика услуг.
//
// Параметры:
//  ДанныеШапки			-	Структура.
//  Движения			-	КоллекцияДвижений.
//  ИмяПоляПоставщик	-	Строка.
//
Процедура ЗаписатьПоставщикаУслуг(ДанныеШапки,Движения,ИмяПоляПоставщик = Неопределено)  Экспорт
	Набор 			= Движения.энргПоставщикиУслугАбонента;
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Документ",ДанныеШапки.Документ);

	Текст 			="
	|ВЫБРАТЬ
	|	ДанныеШапки.Ссылка,
	|	ДанныеШапки.Район,
	|	ДанныеШапки.Организация,
	|	ДанныеШапки.КлючПомещения,
	|	ДанныеТабличнойЧасти.ТочкаУчета,
	|	ДанныеТабличнойЧасти.Услуга,
	|	ДанныеТабличнойЧасти.ЭтоСоставнаяУслуга,
	|	ДанныеТабличнойЧасти.IDСтроки,
	|	ДанныеТабличнойЧасти.Поставщик
	|ПОМЕСТИТЬ ДанныеТочекУчета
	|ИЗ
	|	Документ.%%ИмяТаблицыШапка%%.ТочкиУчета КАК ДанныеТабличнойЧасти
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.%%ИмяТаблицыШапка%% КАК ДанныеШапки
	|		ПО ДанныеТабличнойЧасти.Ссылка = ДанныеШапки.Ссылка
	|			И (ДанныеТабличнойЧасти.Ссылка = &Документ)
	|			И (ДанныеШапки.Ссылка = &Документ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеТочекУчета.Район,
	|	ДанныеТочекУчета.Организация,
	|	ДанныеТочекУчета.КлючПомещения,
	|	ДанныеТочекУчета.ТочкаУчета,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL 
	|			ТОГДА ДанныеТочекУчета.Услуга
	|		ИНАЧЕ ДанныеТабличнойЧастиПоставщики.ЧастьСоставнойУслуги
	|	КОНЕЦ КАК Услуга,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL 
	|			ТОГДА ДанныеТочекУчета.Поставщик
	|		ИНАЧЕ ДанныеТабличнойЧастиПоставщики.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	ВЫБОР
	|		КОГДА ДанныеТабличнойЧастиПоставщики.Ссылка ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЧастьСоставной
	|ИЗ
	|	ДанныеТочекУчета КАК ДанныеТочекУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.%%ИмяТаблицыШапка%%.ПоставщикиСоставныхУслуг КАК ДанныеТабличнойЧастиПоставщики
	|		ПО ДанныеТочекУчета.Ссылка = ДанныеТабличнойЧастиПоставщики.Ссылка
	|			И (ДанныеТочекУчета.ЭтоСоставнаяУслуга)
	|			И ДанныеТочекУчета.IDСтроки = ДанныеТабличнойЧастиПоставщики.IDСтроки";
	
	Если НЕ ИмяПоляПоставщик = Неопределено тогда
		 Текст 			= СтрЗаменить(Текст,"ДанныеТабличнойЧастиПоставщики.Поставщик","ДанныеТабличнойЧастиПоставщики."  + ИмяПоляПоставщик + "");
	КонецЕсли;
	    	
	Запрос.Текст 					= СтрЗаменить(Текст,"%%ИмяТаблицыШапка%%",ДанныеШапки.ИмяДокумента);
	Результат  						= Запрос.Выполнить();
	Выборка  						= Результат.Выбрать();
	Пока Выборка.Следующий() цикл
		Запись 						= Набор.добавить();
		ЗаполнитьЗначенияСвойств(Запись,Выборка);
		Запись.период 				= ДанныеШапки.Дата;
		Запись.ПериодРегистрации	= ДанныеШапки.ПериодРегистрации;
		Запись.ПериодНачисления		= ДанныеШапки.ПериодНачисления;
	КонецЦикла; 	
КонецПроцедуры

// Получает значение тарифа помещения.
//
// Параметры:
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  КлючПомещения	-	СправочникСсылка.энргКлючиПомещений.
//  Услуга			-	СправочникСсылка.энргВидыУслуг.
//  Поставщик		-	СправочникСсылка.энргКонтрагенты.
//  ТарифнаяЗона	-	СправочникСсылка.энргТарифныеЗоны.
//  Дата			-	Дата.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ЗначенияТарифаПомещения(Организация, Район, КлючПомещения, Услуга, Поставщик, ТарифнаяЗона, Дата = Неопределено) Экспорт 
	
	Текст 		= 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргГруппыПотребителейАбонентовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей
	|ПОМЕСТИТЬ ГруппаПотребителейПомещения
	|ИЗ
	|	РегистрСведений.энргГруппыПотребителейАбонентов.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И Услуга = &Услуга) КАК энргГруппыПотребителейАбонентовСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	энргВидБлагоустройствАбонентаСрезПоследних.ВидБлагоустройства КАК ВидБлагоустройства
	|ПОМЕСТИТЬ ВТ_Благоустройства
	|ИЗ
	|	РегистрСведений.энргВидБлагоустройствАбонента.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения
	|				И Услуга = &Услуга) КАК энргВидБлагоустройствАбонентаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргЗначенияТарифовСрезПоследних.Значение КАК Значение,
	|	энргЗначенияТарифовСрезПоследних.ЗначениеРЭК КАК ЗначениеРЭК,
	|	энргЗначенияТарифовСрезПоследних.НДСВнутри КАК НДСВнутри,
	|	энргЗначенияТарифовСрезПоследних.СтавкаНДС КАК СтавкаНДС,
	|	энргЗначенияТарифовСрезПоследних.ГруппаПотребителей КАК ГруппаПотребителей,
	|	ВТ_Благоустройства.ВидБлагоустройства КАК ВидБлагоустройства
	|ИЗ
	|	РегистрСведений.энргЗначенияТарифов.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И ГруппаПотребителей В
	|					(ВЫБРАТЬ ПЕРВЫЕ 1
	|						ГруппаПотребителейПомещения.ГруппаПотребителей
	|					ИЗ
	|						ГруппаПотребителейПомещения КАК ГруппаПотребителейПомещения)
	|				И Услуга = &Услуга
	|				И Поставщик = &Поставщик
	|				И ТарифнаяЗона = &ТарифнаяЗона) КАК энргЗначенияТарифовСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Благоустройства КАК ВТ_Благоустройства
	|		ПО (ИСТИНА)";
	
	Запрос 		= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("КлючПомещения", 	КлючПомещения);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("Район", 			Район);
	Запрос.УстановитьПараметр("Услуга", 		Услуга);
	Запрос.УстановитьПараметр("Поставщик",		Поставщик);
	Запрос.УстановитьПараметр("ТарифнаяЗона",	ТарифнаяЗона);
	Запрос.УстановитьПараметр("Дата",			?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДата()));
	Результат 	= Запрос.Выполнить();
	
	СтруктураТарифа = Новый Структура;
	Для Каждого ТекКолонка Из Результат.Колонки Цикл
		СтруктураТарифа.Вставить(ТекКолонка.Имя,"");
	КонецЦикла;
	
	Выборка  	= Результат.Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураТарифа, Выборка);
	КонецЕсли;
	
	Возврат СтруктураТарифа;
	
КонецФункции

// Получает описание услуги.
//
// Параметры:
//  Услуга	-	СправочникСсылка.энргВидыУслуг.
// 
// Возвращаемое значение:
//   Структура.
//
Функция ОписаниеУслуги(Услуга) Экспорт 
	ОписаниеУслуги 	= Новый Структура;
	Запрос  		= Новый Запрос;
	Запрос.УстановитьПараметр("Услуга",Услуга);	
	Запрос.Текст 	="ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|ГДЕ
	|	энргВидыУслугСоставляющиеУслуг.Ссылка = &Услуга";
	Результат  = Запрос.Выполнить();
	Если Результат.Пустой() тогда
		ОписаниеУслуги.Вставить("ЭтоСоставнаяУслуга",Ложь);
	иначе	
		ОписаниеУслуги.Вставить("ЭтоСоставнаяУслуга",Истина);
		МассивУслуг  	= Новый Массив;
		Выборка  		= Результат.Выбрать();
		Пока Выборка.Следующий() цикл
			МассивУслуг.Добавить(Выборка.услуга);
		КонецЦикла;
		ОписаниеУслуги.Вставить("Услуги",МассивУслуг);
	КонецЕсли;
	Возврат ОписаниеУслуги;
КонецФункции

// Получает состав услуги.
//
// Параметры:
//  Услуга	-	СправочникСсылка.энргВидыУслуг.
// 
// Возвращаемое значение:
//   Массив из СправочникСсылка.энргВидыУслуг.
//
Функция ПолучитьСоставУслуги(Услуга) Экспорт
		
	Текст 	= 
	"ВЫБРАТЬ
	|	энргВидыУслуг.Ссылка КАК Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг КАК энргВидыУслуг
	|ГДЕ
	|	энргВидыУслуг.Ссылка = &Услуга
	|	И НЕ энргВидыУслуг.СоставнаяУслуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО (энргВидыУслугСоставляющиеУслуг.Ссылка = энргВидыУслугСоставляющиеУслуг.Ссылка)
	|			И (энргВидыУслугСоставляющиеУслуг.Ссылка = &Услуга)
	|			И (энргВидыУслуг.Ссылка = &Услуга)
	|			И (энргВидыУслуг.СоставнаяУслуга)";
	
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("Услуга",		Услуга);	
	Запрос.Текст 			= Текст;
	Результат  				= Запрос.Выполнить();	
	Выборка  				= Результат.Выбрать();
	СоставУслуги 			= Новый Массив;
	Пока Выборка.Следующий() Цикл
		СоставУслуги.Добавить(Выборка.Услуга);
	КонецЦикла;
	
	Возврат СоставУслуги;

КонецФункции 

// Получает состав услуги со шкалами.
//
// Параметры:
//  Услуга			-	СправочникСсылка.энргВидыУслуг.
//  ВидКанальности	-	СправочникСсылка.энргВидыКанальности.
// 
// Возвращаемое значение:
//   Массив из Структура:
//    * Услуга	-	СправочникСсылка.энргВидыУслуг.
//    * Шкала	-	СправочникСсылка.энргШкалыПриборовУчета.
//
Функция ПолучитьСоставУслугиСоШкалами(Услуга, ВидКанальности) Экспорт
		
	Текст 	= 
	"ВЫБРАТЬ
	|	энргВидыУслуг.Ссылка КАК Услуга
	|ПОМЕСТИТЬ ВТ_Услуги
	|ИЗ
	|	Справочник.энргВидыУслуг КАК энргВидыУслуг
	|ГДЕ
	|	энргВидыУслуг.Ссылка = &Услуга
	|	И НЕ энргВидыУслуг.СоставнаяУслуга
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	энргВидыУслугСоставляющиеУслуг.Услуга
	|ИЗ
	|	Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг КАК энргВидыУслуг
	|		ПО (энргВидыУслугСоставляющиеУслуг.Ссылка = энргВидыУслугСоставляющиеУслуг.Ссылка)
	|			И (энргВидыУслугСоставляющиеУслуг.Ссылка = &Услуга)
	|			И (энргВидыУслуг.Ссылка = &Услуга)
	|			И (энргВидыУслуг.СоставнаяУслуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	энргВидыКанальностиШкалыПоУслугам.Услуга КАК Услуга,
	|	энргВидыКанальностиШкалыПоУслугам.Шкала КАК Шкала
	|ПОМЕСТИТЬ ВТ_УслугиШкалы
	|ИЗ
	|	Справочник.энргВидыКанальности.ШкалыПоУслугам КАК энргВидыКанальностиШкалыПоУслугам
	|ГДЕ
	|	энргВидыКанальностиШкалыПоУслугам.Ссылка = &ВидКанальности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Услуги.Услуга КАК Услуга,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_УслугиШкалы.Шкала, ЗНАЧЕНИЕ(справочник.энргШкалыПриборовУчета.ПустаяСсылка))) КАК Шкала
	|ИЗ
	|	ВТ_Услуги КАК ВТ_Услуги
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслугиШкалы КАК ВТ_УслугиШкалы
	|		ПО ВТ_Услуги.Услуга = ВТ_УслугиШкалы.Услуга
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Услуги.Услуга";
	
	Запрос  				= Новый Запрос;
	Запрос.УстановитьПараметр("Услуга",				Услуга);
	Запрос.УстановитьПараметр("ВидКанальности",		ВидКанальности);
	Запрос.Текст 			= Текст;
	Результат  				= Запрос.Выполнить();	
	Выборка  				= Результат.Выбрать();
	СоставУслуги 			= Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураУслуги = Новый Структура("Услуга, Шкала");
		ЗаполнитьЗначенияСвойств(СтруктураУслуги, Выборка);
		СоставУслуги.Добавить(СтруктураУслуги);
	КонецЦикла;
	
	Возврат СоставУслуги;

КонецФункции 

#КонецОбласти
